Model: "Psi"
________________________________________________________________________________
Layer (type)              Output Shape      Param #  Connected to               
================================================================================
I1 (InputLayer)           [(None, 1)]       0                                   
________________________________________________________________________________
I2 (InputLayer)           [(None, 1)]       0                                   
________________________________________________________________________________
lambda_210 (Lambda)       (None, 1)         0        I1[0][0]                   
________________________________________________________________________________
lambda_211 (Lambda)       (None, 1)         0        I2[0][0]                   
________________________________________________________________________________
tf_op_layer_Square_60 (Te multiple          0        lambda_210[0][0]           
________________________________________________________________________________
tf_op_layer_Square_61 (Te multiple          0        lambda_210[0][0]           
________________________________________________________________________________
tf_op_layer_Square_62 (Te multiple          0        lambda_211[0][0]           
________________________________________________________________________________
tf_op_layer_Square_63 (Te multiple          0        lambda_211[0][0]           
________________________________________________________________________________
w11 (Dense)               (None, 1)         1        lambda_210[0][0]           
________________________________________________________________________________
w21 (Dense)               (None, 1)         1        lambda_210[0][0]           
________________________________________________________________________________
w31 (Dense)               (None, 1)         1        tf_op_layer_Square_60[0][0]
________________________________________________________________________________
w41 (Dense)               (None, 1)         1        tf_op_layer_Square_61[0][0]
________________________________________________________________________________
w51 (Dense)               (None, 1)         1        lambda_211[0][0]           
________________________________________________________________________________
w61 (Dense)               (None, 1)         1        lambda_211[0][0]           
________________________________________________________________________________
w71 (Dense)               (None, 1)         1        tf_op_layer_Square_62[0][0]
________________________________________________________________________________
w81 (Dense)               (None, 1)         1        tf_op_layer_Square_63[0][0]
________________________________________________________________________________
concatenate_45 (Concatena (None, 4)         0        w11[0][0]                  
                                                     w21[0][0]                  
                                                     w31[0][0]                  
                                                     w41[0][0]                  
________________________________________________________________________________
concatenate_46 (Concatena (None, 4)         0        w51[0][0]                  
                                                     w61[0][0]                  
                                                     w71[0][0]                  
                                                     w81[0][0]                  
________________________________________________________________________________
concatenate_47 (Concatena (None, 8)         0        concatenate_45[0][0]       
                                                     concatenate_46[0][0]       
________________________________________________________________________________
wx2 (Dense)               (None, 1)         8        concatenate_47[0][0]       
================================================================================
Total params: 16
Trainable params: 16
Non-trainable params: 0
________________________________________________________________________________
