Model: "Psi"
________________________________________________________________________________
Layer (type)              Output Shape      Param #  Connected to               
================================================================================
I1 (InputLayer)           [(None, 1)]       0                                   
________________________________________________________________________________
I2 (InputLayer)           [(None, 1)]       0                                   
________________________________________________________________________________
I4 (InputLayer)           [(None, 1)]       0                                   
________________________________________________________________________________
I5 (InputLayer)           [(None, 1)]       0                                   
________________________________________________________________________________
lambda_40 (Lambda)        (None, 1)         0        I1[0][0]                   
________________________________________________________________________________
lambda_41 (Lambda)        (None, 1)         0        I2[0][0]                   
________________________________________________________________________________
lambda_42 (Lambda)        (None, 1)         0        I4[0][0]                   
________________________________________________________________________________
lambda_43 (Lambda)        (None, 1)         0        I5[0][0]                   
________________________________________________________________________________
tf_op_layer_Square_40 (Te multiple          0        lambda_40[0][0]            
________________________________________________________________________________
tf_op_layer_Square_41 (Te multiple          0        lambda_40[0][0]            
________________________________________________________________________________
tf_op_layer_Square_42 (Te multiple          0        lambda_41[0][0]            
________________________________________________________________________________
tf_op_layer_Square_43 (Te multiple          0        lambda_41[0][0]            
________________________________________________________________________________
tf_op_layer_Square_44 (Te multiple          0        lambda_42[0][0]            
________________________________________________________________________________
tf_op_layer_Square_45 (Te multiple          0        lambda_42[0][0]            
________________________________________________________________________________
tf_op_layer_Square_46 (Te multiple          0        lambda_43[0][0]            
________________________________________________________________________________
tf_op_layer_Square_47 (Te multiple          0        lambda_43[0][0]            
________________________________________________________________________________
w11 (Dense)               (None, 1)         1        lambda_40[0][0]            
________________________________________________________________________________
w21 (Dense)               (None, 1)         1        lambda_40[0][0]            
________________________________________________________________________________
w31 (Dense)               (None, 1)         1        tf_op_layer_Square_40[0][0]
________________________________________________________________________________
w41 (Dense)               (None, 1)         1        tf_op_layer_Square_41[0][0]
________________________________________________________________________________
w51 (Dense)               (None, 1)         1        lambda_41[0][0]            
________________________________________________________________________________
w61 (Dense)               (None, 1)         1        lambda_41[0][0]            
________________________________________________________________________________
w71 (Dense)               (None, 1)         1        tf_op_layer_Square_42[0][0]
________________________________________________________________________________
w81 (Dense)               (None, 1)         1        tf_op_layer_Square_43[0][0]
________________________________________________________________________________
w91 (Dense)               (None, 1)         1        lambda_42[0][0]            
________________________________________________________________________________
w101 (Dense)              (None, 1)         1        lambda_42[0][0]            
________________________________________________________________________________
w111 (Dense)              (None, 1)         1        tf_op_layer_Square_44[0][0]
________________________________________________________________________________
w121 (Dense)              (None, 1)         1        tf_op_layer_Square_45[0][0]
________________________________________________________________________________
w131 (Dense)              (None, 1)         1        lambda_43[0][0]            
________________________________________________________________________________
w141 (Dense)              (None, 1)         1        lambda_43[0][0]            
________________________________________________________________________________
w151 (Dense)              (None, 1)         1        tf_op_layer_Square_46[0][0]
________________________________________________________________________________
w161 (Dense)              (None, 1)         1        tf_op_layer_Square_47[0][0]
________________________________________________________________________________
concatenate_30 (Concatena (None, 4)         0        w11[0][0]                  
                                                     w21[0][0]                  
                                                     w31[0][0]                  
                                                     w41[0][0]                  
________________________________________________________________________________
concatenate_31 (Concatena (None, 4)         0        w51[0][0]                  
                                                     w61[0][0]                  
                                                     w71[0][0]                  
                                                     w81[0][0]                  
________________________________________________________________________________
concatenate_32 (Concatena (None, 4)         0        w91[0][0]                  
                                                     w101[0][0]                 
                                                     w111[0][0]                 
                                                     w121[0][0]                 
________________________________________________________________________________
concatenate_33 (Concatena (None, 4)         0        w131[0][0]                 
                                                     w141[0][0]                 
                                                     w151[0][0]                 
                                                     w161[0][0]                 
________________________________________________________________________________
concatenate_34 (Concatena (None, 16)        0        concatenate_30[0][0]       
                                                     concatenate_31[0][0]       
                                                     concatenate_32[0][0]       
                                                     concatenate_33[0][0]       
________________________________________________________________________________
wx2 (Dense)               (None, 1)         16       concatenate_34[0][0]       
================================================================================
Total params: 32
Trainable params: 32
Non-trainable params: 0
________________________________________________________________________________
